// number — тип для числовых значений;
// string — тип для строковых значений;
// boolean — тип для  булевых значений, принимает в себя true или false;
// array — тип обозначающий массивы.
// null и undefined — Примитивные типы, которые соответствуют значениям null и undefined в javascript.
// symbol — представляет собой уникальный идентификатор. По спецификации в качестве ключей для свойств объектов могут использоваться только строки или символы.
// bigInt - как в js, большие чсловые значения.
// any — специальный тип, который используется для отключения проверки типа. Будет полезен, когда присеваемое переменой значение, может менять свой тип.
// enum — тип для перечисляемых значений. Представляет собой набор логически связанных констант, в качестве значений которых могут выступать как числа, так и строки. В случае, когда идентификаторам констант значение не устанавливается явно, они ассоциируются с числовым значениями, в порядке возрастания, начиная с нуля.
// never — тип для переменной, у которой отсутствие значение. Обычно используется в качестве возвращаемого типа функций, которые генерируют или возвращают ошибку.
// void - если нужно прописать пустой тип для функции (если функция ничего не возвращает).
